app/controllers/gossip_show_controller.rb

  def show
    @gossip = Gossip.find(params[:user_entry])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]