app/controllers/profile_controller.rb

  def view
    received_id = params["user_id"]
    @user = User.find(received_id)
    @user_first_name = @user.first_name
    @user_last_name = @user.last_name
    @user_age = @user.age
    @user_description = @user.description
    user_city_id = @user.city_id
    @user_city = City.find(user_city_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]