app/controllers/static_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def index
    @all_gossips_array = Gossip.all