app/models/gossip.rb

  def find_author_name
    author_id = self.user_id.to_i
    author_array = []
    author_array << User.find_by(id: author_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]